stm32duino/stm32_svd/svd/STM32WBAxx/STM32WBA24.svd
        <register>
          <name>RCC_AHB4SMENR</name>
          <displayName>RCC_AHB4SMENR</displayName>
          <description>RCC AHB4 peripheral clocks enable in Sleep and Stop modes register</description>
          <addressOffset>0x0BC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PWRSMEN</name>
              <description>PWR bus clock enable during Sleep and Stop modes
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>PWR bus clock disabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>PWR bus clock enabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC4SMEN</name>
              <description>ADC4 bus and kernel clocks enable during Sleep and Stop modes
</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>ADC4 bus and kernel clocks disabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>ADC4 bus and kernel clocks enabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RCC_AHB5SMENR</name>
          <displayName>RCC_AHB5SMENR</displayName>
          <description>RCC AHB5 peripheral clocks enable in Sleep and Stop modes register</description>
          <addressOffset>0x0C0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RADIOSMEN</name>
              <description>2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>2.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>2.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTACONVSMEN</name>
              <description>Reserved, must be kept at reset value.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCC_APB1SMENR1</name>
          <displayName>RCC_APB1SMENR1</displayName>
          <description>RCC APB1 peripheral clocks enable in Sleep and Stop modes	register 1</description>
          <addressOffset>0x0C4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIM2SMEN</name>
              <description>TIM2 bus and kernel clocks enable during Sleep and Stop modes
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>TIM2 bus and kernel clocks disabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>TIM2 bus and kernel clocks enabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C1SMEN</name>
              <description>I2C1 bus and kernel clocks enable during Sleep and Stop modes
</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>I2C1 bus and kernel clocks disabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>I2C1 bus and kernel clocks enabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RCC_APB1SMENR2</name>
          <displayName>RCC_APB1SMENR2</displayName>
          <description>RCC APB1 peripheral clocks enable in Sleep and Stop modes 	register 2</description>
          <addressOffset>0x0C8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPTIM2SMEN</name>
              <description>LPTIM2 bus and kernel clocks enable during Sleep and Stop modes
</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>LPTIM2 bus and kernel clocks disabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>LPTIM2 bus and kernel clocks enabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RCC_APB2SMENR</name>
          <displayName>RCC_APB2SMENR</displayName>
          <description>RCC APB2 peripheral clocks enable in Sleep and Stop modes register</description>
          <addressOffset>0x0CC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USART1SMEN</name>
              <description>USART1 bus and kernel clocks enable during Sleep and Stop modes
</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>USART1 bus and kernel clocks disabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>USART1 bus and kernel clocks enabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIM16SMEN</name>
              <description>TIM16 bus clock enable during Sleep and Stop modes
</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>TIM16 bus clock disabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>TIM16 bus clock enabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIM17SMEN</name>
              <description>TIM17 bus clock enable during Sleep and Stop modes
</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>TIM17 bus clock disabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>TIM17 bus clock enabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI1SMEN</name>
              <description>SAI1 bus and kernel clocks enable during Sleep and Stop modes
</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SAI1 bus and kernel clocks disabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>SAI1 bus and kernel clocks enabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBSMEN</name>
              <description>USB bus and kernel clocks enable during Sleep and Stop modes
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>USB bus and kernel clocks disabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>USB bus and kernel clocks enabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RCC_APB7SMENR</name>
          <displayName>RCC_APB7SMENR</displayName>
          <description>RCC APB7 peripheral clock enable in Sleep and Stop modes register</description>
          <addressOffset>0x0D0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SYSCFGSMEN</name>
              <description>SYSCFG bus clock enable during Sleep and Stop modes
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SYSCFG bus clock disabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>SYSCFG bus clock enabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPI3SMEN</name>
              <description>SPI3 bus and kernel clocks enable during Sleep and Stop modes
</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SPI3 bus and kernel clocks disabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>SPI3 bus and kernel clocks enabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART1SMEN</name>
              <description>LPUART1 bus and kernel clocks enable during Sleep and Stop modes
</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>LPUART1 bus and kernel clocks disabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>LPUART1 bus and kernel clocks enabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C3SMEN</name>
              <description>I2C3 bus and kernel clocks enable during Sleep and Stop modes
</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>I2C3 bus and kernel clocks disabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>I2C3 bus and kernel clocks enabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPTIM1SMEN</name>
              <description>LPTIM1 bus and kernel clocks enable during Sleep and Stop modes
</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>LPTIM1 bus and kernel clocks disabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>LPTIM1 bus and kernel clocks enabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCAPBSMEN</name>
              <description>RTC and TAMP APB clock enable during Sleep and Stop modes
</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>RTC and TAMP APB clock disabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>RTC and TAMP APB clock enabled by the clock gating during Sleep and Stop modes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
